{
	"description": "2021，許多人稱此為與疫情共存的開端，對我們而言，則將此視為人們以嶄新的方式，重啟交流的契機。\n\n延續前一屆社企組的理念，除了保持競賽題目的多樣性外，2021 梅竹黑客松更加重視人與人之間的交流，因此將「社企組」轉變為「交流組」。在科技發展迅速、疫情植根於社會的時代，我們期望能回歸黑客松的本質 —— 鼓勵參賽者勇於提出自己的想法，與他人切磋、交流，藉此激發出不一樣的可能。\n\n今年因為疫情的緣故，2021 梅竹黑客松改為線上舉辦，我們透過參與感較高的軟體 Gather 作為虛擬活動場地，搭配學生熟悉的語音軟體 Discord 作為討論和 Demo 的工具，嘗試還原線下熱情與緊張的氣氛。此外，2021 年梅竹黑客松邀請到美光、原相、Supermicro、104 以及 Line 擔任黑客組的合作企業。另外，我們將社企組改為交流組，並讓參賽者自訂題目，以不同的角度切入問題，提供更加多元的解決方案。2021 年參賽總人數為 201 人，其中有 42% 的參賽者來自國立陽明交通大學、35% 來自國立清華大學、23% 來自其餘學校。\n\n礙於疫情，2021 梅竹黑客松改為線上舉辦，但我們仍堅信，人們交流的間隔必定遠小於彼此間的距離。\n\n從歷史洪流來看，有點陣遊戲如 Pac-Man 的出現，造就了後續現代科技的遊戲，甚至讓網路界面得以逐步發展完善。因此本屆主視覺想藉由 Pac-Man 的點陣遊戲定位代入黑客松的科技意象。另外也參考 Pac-Man 中將角色分顏色的部分來將參賽組別做分類。",
	"competition": {
		"systems": [
			{
				"type": "hacker",
				"title": "黑客組",
				"description": "搭起學生與企業之間的橋樑，學生發揮潛力回應企業的挑戰，企業方更能提供實習機會，讓學生進一步實踐創意發想！由五家企業作為引導單位，初賽時由各企業選出前三名獲得企業獎。企業獎第一名進入決賽，決賽時再由五隊中選出梅竹大獎首獎隊伍。"
			},
			{
				"type": "idea",
				"title": "交流組",
				"description": "我們期許跨領域人才的加入，以不同角度切入問題，提供更多元的解決方案，比起競賽我們更重視過程中想法的激盪，並肯定每個創新的想法。交流組的參賽者可自訂題目，透過議題的多樣性，賦予梅竹黑客松不一樣的可能。"
			}
		]
	},
	"scenes": {
    	"description": "2021 梅竹黑客松使用 Gather 當作我們的線上比賽場地，開閉幕時大家都整齊的坐在位置上，看起來看起來是不是非常療癒呢？\n\n梅竹黑客松活動當天同時舉辦企業博覽會，即使是非參賽者也能入場逛企業博覽會、參與抽獎，甚至還有許多娛樂活動供參賽者參加！\n\n上台頒獎時是由替身小人上台領獎，畫面看起來非常可愛對吧！",
		"img": [
			"2021-1.JPG",
			"2021-2.PNG",
			"2021-3.JPG",
			"2021-4.PNG",
			"2021-5.PNG"
		]
	},
	"topics": [
		{
			"company": "美光",
			"title": "Design an effective solution to load huge amount of data into Cloud platform and visualize the result",
			"description": "Cloud platform becomes widely adopted with its better flexibility, reliability, and performance in\nMachine Learning and Artificial Intelligence analytics compared with the On-prem platform. So, we see\nthe trend for corporates to migrate their corporate Data Warehouse from the On-prem platform to\nCloud platform. However, considering the huge amount of data with different patterns stored in the\ncurrent On-prem platform, how to move these data to Cloud platform effectively becomes the key to a\nsuccessful migration that will minimize the impacts to business during the migration.\n\nWe would like to invite the participants who are interested in this topic to use the Data Warehouse\ntechniques you have learned to design the solutions to load the huge amount of sample data from\npublic data sources (Google Public Dataset, UCI, OpenData or Kaggle) into Google Cloud Platform (GCP)\nin the appropriate formats (Cloud SQL, BigQuery, BigTable, or Cloud Spanner), then use the data\nvisualization tools in GCP (Data Studio or other BI tools) to present the results. The related platform\nenvironment and resources in GCP will be provided to the participants.\n\nThe measurements of the success will include accomplishment, innovation, presentation, and\ncomplexity of the project. Look forward to your participation and have fun in the Hackathon.",
            "pdf": "https://2021.meichuhackathon.org/questions/Micron.pdf"
		},
		{
			"company": "原相",
			"title": "Intelligent sensing solutions for smart home applications",
			"description": "The Internet of Things (IoT), smart homes, smart phones, wearables - consumer\nelectronics have permeated every aspect of human life. By leveraging PixArt’s sensor\nsolutions, we can make more devices smarter and create new ones that add significant\nvalue to the end user. Our mission is provide a more comfortable life at home.",
			"pdf": "https://2021.meichuhackathon.org/questions/PixArt.pdf"
		},
		{
			"company": "Supermicro",
			"title": "貨櫃堆疊空間利用之最佳化方案",
			"description": "隨著全球航運需求的增加，貨櫃運送價格等運輸成本在今年上半年即呈現⾶快上漲的趨\n勢。如此快速的成本提升也牽動著全世界科技業與製造業的營運。在環境的變化與疫情衝\n擊下，我們需要善⽤資源以減少不必要的浪費。⼀個能讓貨櫃空間利⽤最佳化的解決⽅案\n不僅可以讓全球眾多產業節省資源，更能減少不必要的污染以達到永續發展的⽬的。\n我們的⽬標是開發⼀個有效規劃貨櫃空間利⽤的軟體，由此軟體運算出的裝配⽅式能讓貨\n櫃內物件合理堆疊，不僅節省空間的利⽤，也考量到堆疊的結果是否穩固與重量分配。此\n軟體需能夠⾼效運算並以 3D 視覺化⽅式呈現規劃結果。",
			"pdf": "https://2021.meichuhackathon.org/questions/Supermicro.pdf"
		},
		{
			"company": "104",
			"title": "探索資料價值，進化職場環境",
			"description": "利⽤104提供之職缺資料可串接第三⽅公開資料，提供具有創意的web、mobile\napp或api服務，利⽤資料價值，打造更好的職場環境。\n可利⽤的第三⽅公開資料：房價實價登錄、台灣地區物價統計、家戶所得、交通\n資料、台灣疫情統計資料…等等。\n",
			"pdf": "https://2021.meichuhackathon.org/questions/104.pdf"
		},
		{
			"company": "LINE",
			"title": "藉由 LINE API 打造數位新生活",
			"description": "作為⼤家每天使⽤的 LINE，為了讓每位⽤戶的⽇常使⽤習慣⼀致，⽣活周遭有許\n多 場所 / 店家 / 群組 希望擁有屬於⾃⼰品牌的服務與⽤戶互動，尤其在疫情下的\n新常態⽣活更需要透過科技解決以上問題。\n本次將藉由每位同學的創意並透過 LINE 平台的技術打造應⽤服務，讓受到疫情\n衝擊的我們也能透過科技來拉近彼此間的距離。",
			"pdf": "https://2021.meichuhackathon.org/questions/LINE.pdf"
		}
	],
	"sponsors": [
		{
			"group": "早餐合作單位",
			"companies": ["梅竹黑客松"]
		}
	],
	"staffs": [
		{
			"dept": "行政部",
			"members": ["黃俊瑋", "陳存佩"]
		},
		{
			"dept": "行銷部",
			"members": ["陳昱心", "涂子峻", "曾彥穎", "莊采柔", "周雨欣", "林沛含", "王致凱"]
		},
		{
			"dept": "公關部",
			"members": ["石郁琳", "葉千慈", "楊凱湉", "楊叔晴", "謝子晴", "張晏瑄", "莊婕妤", "黃琦婷"]
		},
		{
			"dept": "活動部",
			"members": ["詹晏皇", "曾詩皓", "石妤喬", "林佳穎", "邱弘竣", "洪佳信", "周庭瑜", "朱緯騰", "許靜怡"]
		},
		{
			"dept": "財務部",
			"members": ["涂子峻", "劉栖寧", "陳永諭", "吳奕蓁", "孫瑜雅", "林言臻"]
		},
		{
			"dept": "設計部",
			"members": ["高永翰", "林汶螢", "邱孟淯", "洪顥耘", "葉聿昕", "吳承祐"]
		},
		{
			"dept": "開發部",
			"members": ["陳昱穎", "王翊語", "邵筱庭", "周昱宏", "黃俊嘉", "王柏涵", "夏宇澄", "許博翔"]
		}
	]
}
